{
    "experiences": [
        {
            "title": "RPA Intern",
            "subtitle": "Scotiabank",
            "workDescription": [
                "Monitored 55+ robotic process automation (RPA) workflows using Blue Prism to ensure reliability and performance",
                "Partnered with business teams to identify repetitive, rule-based tasks suitable for automation, enhancing efficiency."
            ],
            "dateText": "01/2025 – 04/2025"
        },
        {
            "title": "Machine Vision Technical Writer Intern",
            "subtitle": "Zebra Technologies",
            "workDescription": [
                "Developed and refined 100+ pages of technical documentation in Oxygen XML Editor, applying C expertise",
                "Worked closely with developers to update user guides and function references for the Aurora Imaging Library."
            ],
            "dateText": "09/2024 – 12/2024"
        },
        {
            "title": "Sponsorship Coordinator",
            "subtitle": "uOttaHack - University of Ottawa",
            "workDescription": [
                "Manage sponsorship outreach and negotiation, partnering with industry leaders and other diverse sponsors",
                "Cultivate relationships with a wide network of over 30 sponsors, facilitating coordination for successful execution." 
            ],
            "dateText": "04/2024 – 01/2025"
        },
        {
            "title": "Head Delegate - University of Ottawa",
            "subtitle": "CUSEC: Canadian University Software Engineering Conference",
            "workDescription": [
                "Drive promotional strategies to increase student involvement and enthusiasm for the CUSEC conference",
                "Coordinate travel logistics and accommodations for a group of over **50** students attending the conference",
                "Facilitate the procurement of financing from the school administration to facilitate student attendance."
            ],
            "dateText": "04/2024 – 01/2025"
        },
        {
            "title": "VP of Philanthropy",
            "subtitle": "Computer Science Student Association - University of Ottawa",
            "workDescription": [
                "Plan and host on and off-campus student events, occasionally working with other faculty organizations, to raise hundreds of dollars for a variety of honourable causes; promoting volunteer work and bettering our community",
                "Developed promotional Instagram media content using **Figma, Canva, and Adobe Fresco** to encourage involvement",
                "Explored ways to connect with the community through cold emails to partner on fundraising and sponsorship."
            ],
            "dateText": "03/2023 – Present"
        }
    ]
}