{
<<<<<<< HEAD
  "howiwork": "## How I Work\n\nI'm currently enrolled in a UI design course where I'm learning key design concepts and best practices for creating intuitive, user-centered interfaces.\n\nAs part of the course, I explore:\n\n- User-centered design\n- Heuristic evaluation\n- Information architecture\n- Accessibility in design\n\nSome resources I'm learning from:\n\n- [NN/g: Nielsen Norman Group](https://www.nngroup.com/)\n- [Course Materials on Brightspace](https://brightspace.uottawa.ca/)\n\nAs I continue learning, I'm excited to apply these concepts to real-world projects and evolve my design process further."
=======
  "howiwork": {
    "title": "How I Work",
    "description": "As a student currently enrolled in a UI/UX design course, I am actively learning foundational principles of user interface design, usability, and the user-centered design process. My workflow is evolving as I gain hands-on experience through coursework, projects, and research-based design practices.",
    "sections": [
      {
        "heading": "What I’m Learning",
        "bullets": [
          "Visual hierarchy",
          "Consistency and feedback",
          "User-centered design",
          "Accessibility and inclusive design",
          "Heuristic evaluation",
          "Information architecture"
        ],
        "links": [
          {
            "label": "Nielsen Norman Group (NN/g)",
            "url": "https://www.nngroup.com/"
          },
          {
            "label": "Material Design by Google",
            "url": "https://m3.material.io/"
          },
          {
            "label": "Interaction Design Foundation",
            "url": "https://www.interaction-design.org/"
          }
        ]
      },
      {
        "heading": "My (Developing) Design Workflow",
        "steps": [
          "Research & Requirements Gathering – Understand user needs through interviews, surveys, or competitive analysis.",
          "Sketching & Wireframing – Use tools like Figma to outline basic layouts and interactions.",
          "Prototyping – Create interactive prototypes that simulate user flow and behaviors.",
          "Feedback & Iteration – Conduct usability testing with peers and iterate on design based on findings.",
          "Final UI Design – Apply visual styling, typography, and branding for a polished product.",
          "Handoff or Implementation – Prepare assets and design specs for development."
        ]
      },
      {
        "heading": "Course I'm Taking",
        "courseTitle": "User Interface Design (SEG3125) – University of Ottawa",
        "courseDescription": "Includes topics like wireframing, usability heuristics, and responsive UI design."
      }
    ],
    "note": "This section will be updated throughout the semester as I apply new concepts and develop a more refined design process."
  }
>>>>>>> b24287e (added case study and how i work content)
}
